philo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-07-13 බ 22:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="bmax" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org475043e">1. Remember the affirmation shit I told:</a></li>
<li><a href="#orgefbdf1f">2. LoA says:</a></li>
<li><a href="#orgb465208">3. Going back to Buddhism:</a></li>
<li><a href="#org4821019">4. Karmaya and Wipakaya closer look:</a></li>
<li><a href="#org2d51d0c">5. How LoA is Karma</a></li>
</ul>
</div>
</div>
<p>
So basically:
</p>
<blockquote>
<p>
What buddha has said is:
    "chethanawa karmayata mula"
</p>
</blockquote>

<p>
Chethannawa means something like "intention" in plain english.
 so it's not just a thought.
</p>

<p>
So it's a bit more involved, or has emotional effect than just a mere thought.
</p>

<div id="outline-container-org475043e" class="outline-2">
<h2 id="org475043e"><span class="section-number-2">1.</span> Remember the affirmation shit I told:</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>You have to thank (meaning relase positive vibes (sort of)) to the world.</li>
<li>they have to be genuin, so not just thought.</li>
<li>this is the essensne of mithree bhawanawa, it's not just repeating some sentences in your head.</li>
</ul>
</div>
</div>

<div id="outline-container-orgefbdf1f" class="outline-2">
<h2 id="orgefbdf1f"><span class="section-number-2">2.</span> LoA says:</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>you become what you think about</li>
<li>you beomce what you feel</li>
<li>thoughts becomem your reality</li>
<li>you become what you think you are</li>
<li>whether you believe you can or can't you are always right</li>
<li>if you say this stuff doesn't work, you are right that stuff doesn't work for you</li>
<li>if you say this stuff works, you are still right, taht stuff works for you</li>
<li>you can apply anything to "stuff" here, it could be anything: LoA, Buddhisum, Wasthu, Horescope, Rahu kaale, Maths, Programming, Web development, Going Abroadd.</li>
</ul>
</div>
</div>


<div id="outline-container-orgb465208" class="outline-2">
<h2 id="orgb465208"><span class="section-number-2">3.</span> Going back to Buddhism:</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Karmaya is what chethanawa builds</li>
<li>but what you experience is wipakaya</li>
<li>karmaya applies through wipaakaya</li>

<li>wipakaya could be come to any of the 5 senses</li>
<li>so things you feel, touch, taste, hear are wipaka thus some result of karma.</li>
<li>confusing part is thoughts can also be wipaka (wipaka sith), but thoughts can be not wipaka too (so that's why we are not doomed, we can still escape this karma -&gt; wipaka cycle)</li>
</ul>
</div>
</div>

<div id="outline-container-org4821019" class="outline-2">
<h2 id="org4821019"><span class="section-number-2">4.</span> Karmaya and Wipakaya closer look:</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Wipaka you get is a result of past karma.</li>
<li>past here is any moment prior to this moment.</li>
<li>so what your "chethana" a minute a go can becomem a karma wipaka in any moment from now on wards.</li>
</ul>
</div>
</div>

<div id="outline-container-org2d51d0c" class="outline-2">
<h2 id="org2d51d0c"><span class="section-number-2">5.</span> How LoA is Karma</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>You "chethana" you had in the so called "past" gives you "wipaka"</li>
<li>you become what you feel</li>
<li>so what your "chethana" at this moment affects what is to come to you in the future.</li>
<li>I can go on and write more, but I think if you read this long you get the point.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: bmax</p>
<p class="date">Created: 2022-07-13 බ 22:40</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
<style>
  body {
  font-size: 2em;

  }
  h1, h2, p, li {

  line-height: 1.2em;
  color: #444;
  font-family: sans-serif;
  }
</style>
</body>
</html>
